Обработки/Reports/_ПоказателиДеятельностиИКвартальныеДиапазоныИхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ПоказателиДеятельностиИКвартальныеДиапазоныИхЗначений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ПоказателиДеятельностиИКвартальныеДиапазоныИхЗначений/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период.ДатаОкончания = НачалоКвартала(ТекущаяДатаСеанса())-1;
	Отчет.Период.ДатаНачала = НачалоКвартала(Отчет.Период.ДатаОкончания);
	Отчет.ВариантОтчета = "Редакция20201216";
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.ТабличныйДокумент, "НЕАКТУАЛЬНОСТЬ");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	ОтчетНаСервере = РеквизитФормыВЗначение("Отчет");
	ЭтаФорма.Результат = ОтчетНаСервере.СформироватьОтчет();
	ЭтаФорма.ТабличныйДокумент = ЭтаФорма.Результат;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("ТабличныйДокумент") Тогда
		СтандартнаяОбработка = Ложь;
		ЭтаФорма.ТабличныйДокумент = Расшифровка;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	Если Область.Текст = "Вернуться к отчету" Тогда
		СтандартнаяОбработка = Ложь;
		ЭтаФорма.ТабличныйДокумент = ЭтаФорма.Результат;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
КонецПроцедуры
